import math

a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))

if a == 0:
    print("Это не квадратное уравнение!")
else:
    D = b ** 2 - 4 * a * c  # вычисление дискриминанта

    if D > 0:  # при положительном дискриминанте существует 2 корня
        x1 = (-b + math.sqrt(D)) / (2 * a)
        x2 = (-b - math.sqrt(D)) / (2 * a)
        print(f"2 корня: x1 = {x1:.2f}, x2 = {x2:.2f}")
    elif D == 0:  # при нулевом дискриминанте существует 1 корень
        x = -b / (2 * a)
        print(f"Один корень: x = {x:.2f}")
    else:
        print("Нет действительных корней")