print("Игра: Счастливые, Загадочные, Безопасные и Убийственные числа!")
print("Правила: избегай убийственных чисел, загадочные пропускают ход.")
print("Для выхода введи 0.\n")
while True:
    try:
        number = int(input("Введите число от 1 до 33: "))
    except ValueError:
        print("Это не число! Попробуйте снова.")
        continue  # пропуск остальной части цикла при некорректном вводе
    if number == 0:
        print("Игра окончена!")
        break
    if number > 33:
        print("Эй, число должно быть до 33! Попробуй еще раз")
        continue  # цикл начинается сначала и игра продолжается
    killers = [3, 11, 23, 29, 33]
    if number in killers:
        print(f"Вы проиграли! Число-убийца - {number}")
        break  # Прерываем цикл while полностью
    mistik = [4, 8, 22]
    lucky = [7, 21, 32]
    if number in mistik:
        print(f"Загадочное число {number}! Ничего не произошло...")
        pass  # Придумать интересный ход позжe
        continue  # цикл начинается сначала и игра продолжается
    elif number in lucky:
        print(f"Вы победили! Счастливое число - {number}")
        break  # победа: выход из цикла и завершение программы
    print(f"Отличный выбор! Число {number} безопасно.")
