def tobinary(num_10):
    num_10 = abs(num_10) # работаем с модулем, чтобы обрабатывать и отрицательные числа
    if num_10 == 0:
        return "0"
    num_2 = ""
    while num_10 != 0:
        ost = str(num_10 % 2) # остаток от деления(0 или 1)
        num_2 = ost + num_2 # приписываем слева
        num_10 //= 2 # целочисленно делим число
    return num_2

def main():
    try:
        num_10 = int(input("Введите число в 10 сс:")) # запрос ввода числа в 10-тичной сс

        # ЧЕРЕЗ ФУНКЦИЮ bin()
        num_2bin = bin(num_10)[2:] # [2:] нужен, чтобы убрать префикс '0b'

        # ВРУЧНУЮ
        num_2 = tobinary(num_10)

        # ВЫВОДЫ
        print(f"Десятичное число {num_10} в двоичной сс равно {num_2bin}(через функцию bin)")
        print(f"Десятичное число {num_10} в двоичной сс равно {num_2}(вручную)")

    except ValueError:
        print("Ошибка: нужно ввести именно целое число!!!!")
if __name__ == "__main__":
    main()





